{
    "df49a114-9f24-47cf-8f79-13403ab3db60": {
        "title": "search algorithms",
        "shortDescription": "Practice search algorithms.",
        "longDescription": "Searching algorithms are some of the most useful algorithms to know, used to check for or retrieve a given element from a data structure. At surface level, you're probably familiar with implementations of map, filter, or find, but depending on what language you use and even the constraints of a given framework or library, you may have to resort to using a search algorithm.\nPractice implementing:\nLinear Search\nSentinel Linear Search\nBinary Search\nBinary Search\nOne-sided Binary Search\nTernary Search\nJump Search\nInterpolation Search\nExponential Search\nFibonacci Search\nUbiquitous Binary Search",
        "type": "algorithm"
    },
    "a5b44faf-e463-4bf2-965c-935bd42a95e0": {
        "title": "arrays",
        "shortDescription": "Practice using arrays.",
        "longDescription": "Arrays are one of the most used and well known data structures, but based on the programming language you use, you may mistake an implementation for an array, when it's not. For example, arrays in JavaScript are lists. Why? An array is a collection consisting of a fixed number of items of the same size, stored at contiguous memory locations. This means, you cannot remove or append elements without redeclaring the structure.\nReal-life applications of arrays include:\nArrangement of a leaderboard in descending order\nQuestion paper of number questions with assigned marks\nSpeech processing\nBook titles in a library management system\nOnline ticket booking\nContacts list\nCPU scheduling\nPossible moves on a chessboard\nStore images of a specific size\nPractice implementing arrays.",
        "type": "data structure"
    },
    "70d957b8-09c2-41c2-8ca7-01f92dd273cd": {
        "title": "configure wardrobe",
        "shortDescription": "Calculate combinations of wardrobe elements based on one and two dimensions, and then find the cheapest combination.",
        "longDescription": "A Swedish furniture dealer offers two lines of wardrobes: stacking and non-stacking. Both lines feature wardrobes of width: 50 cm, 75 cm, 100cm, and 120cm. The default total length and height of a wall are 250 cm. Write functions for the following:\nCalculate all combinations of non-stacking wardrobes that exactly fit the wall\nCalculate all combinations of stacking wardrobes that exactly fit the wall\nThe price list for the non-stacking wardrobes is as follows: 50 cm for 59 USD, 75 cm for 62 USD, 100 cm for 90 USD, and 120 cm for 111 USD. The price of stacking wardrobes are based on the width and a third of the price for the height.\nBased on your results, calculate the cheapest combination for stacking and non-stacking wardrobes.",
        "type": "kata"
    }
}